OpenFOAM-v1806/tutorials/multiphase/interFoam/RAS/waterChannel/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         200;

deltaT          0.1;

writeControl    adjustableRunTime;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           6;
maxAlphaCo      6;
maxDeltaT       1;

functions
{
    inletFlux
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl   timeStep;
        log             true;
        // Output field values as well
        writeFields     false;
        regionType      patch;
        name            inlet;
        operation       sum;

        fields
        (
            rhoPhi
        );
    }

    outletFlux
    {
        $inletFlux;
        name            outlet;
    }

    atmosphereFlux
    {
        $inletFlux;
        name            atmosphere;
    }

    sTransport
    {
        type            scalarTransport;
        libs            ("libsolverFunctionObjects.so");

        enabled         true;
        writeControl    outputTime;
        writeInterval   1;

        field           s;
        bounded01       false;
        phase           alpha.water;

        write           true;

        fvOptions
        {
            unitySource
            {
                type            scalarSemiImplicitSource;
                enabled         true;

                scalarSemiImplicitSourceCoeffs
                {
                    selectionMode   all;
                    volumeMode      specific;
                    injectionRateSuSp
                    {
                        s           (1 0);
                    }
                }
            }
        }

        resetOnStartUp  false;
    }
}

// ************************************************************************* //
